# Homework

## Problem 4

### Import the libraries

#### Import արեք pandas գրադարանը pd  անունով

In [1]:
pwd

'C:\\Users\\Acer\\ML\\Practical2'

In [2]:
ls

 Volume in drive C has no label.
 Volume Serial Number is 60B3-4AC7

 Directory of C:\Users\Acer\ML\Practical2

23.02.2021  16:20    <DIR>          .
23.02.2021  16:20    <DIR>          ..
23.02.2021  16:13    <DIR>          .ipynb_checkpoints
23.02.2021  16:20    <DIR>          data
23.02.2021  16:11           843 562 Matplotlib_practical_homework.ipynb
23.02.2021  16:10            25 753 Pandas_Homework.ipynb
23.02.2021  16:11            14 817 Pandas_practical.ipynb
               3 File(s)        884 132 bytes
               4 Dir(s)  51 809 054 720 bytes free

In [3]:
import pandas as pd
d = pd.read_csv('data/baby_names.csv')
d.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

In [4]:
d.drop(['Unnamed: 0', 'Id'], axis=1)

         Name  Year Gender State  Count
0        Emma  2004      F    AK     62
1     Madison  2004      F    AK     48
2      Hannah  2004      F    AK     46
3       Grace  2004      F    AK     44
4       Emily  2004      F    AK     41
...       ...   ...    ...   ...    ...
2498    Devin  2004      M    AK     12
2499     Liam  2004      M    AK     12
2500     Paul  2004      M    AK     12
2501  Richard  2004      M    AK     12
2502  Trenton  2004      M    AK     12

[2503 rows x 5 columns]

### Import the dataset baby_names.txt, assign it to a variable called baby_names

### Import արեք baby_names.txt dataset-ը ու այն վերագրեք baby_names փոփոխականի

In [6]:
baby_names = pd.read_csv('data/baby_names.csv')

### See the first 10 entries.

### Տպեք առաջին 10 արժեքը

In [7]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Delete the columns 'Unnamed: 0' and 'Id'

### Ջնջեք 'Unnamed: 0' ու 'Id' սյուները

In [10]:
baby_names.drop(['Unnamed: 0', 'Id'],axis=1, inplace=True)
baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Are there more male or female names in the dataset?

### Արդյոք dataset-ում ավելի շատ են կանացի թե տղամարդու անունները?

In [11]:
baby_names['Gender'].value_counts()

F    2404
M      99
Name: Gender, dtype: int64

### Delete the column 'Year'. Group the dataset by name and assign to names.

### Ջնջեք 'Year' սյունը. Խմբավորեք dataset-ը ըստ անունի ու վերագրեք արդյունքը names փոփոխականին

In [16]:
names = baby_names.drop(['Year'],axis=1)
names.head()

      Name Gender State  Count
0     Emma      F    AK     62
1  Madison      F    AK     48
2   Hannah      F    AK     46
3    Grace      F    AK     44
4    Emily      F    AK     41

### How many different names exist in the dataset?

### Քանի հատ տարբեր անուն կա dataset-ում?

In [17]:
names.nunique()

Name      575
Gender      2
State       1
Count      57
dtype: int64

In [18]:
names['Name'].nunique()

575

### What is the name with most occurrences?

### Որն է ամենաշատ հանդիպող անունը?

In [19]:
names['Name'].mode()

0    Riley
dtype: object

In [20]:
names['Name'].value_counts().head()

Riley     12
Anna      11
Kaylee    11
Mia       11
Aurora    11
Name: Name, dtype: int64

### What is the median name occurrence?

### Որն է անունների հանդիպման մեդիանը՞

In [22]:
names['Name'].value_counts().median()

3.0

### Get a summary with the mean, min, max, std and quartiles.

### Ստացեք dataset-ի ամփոփում mean, min, max, std ու quartile-ներով

In [26]:
names.describe()

             Count
count  2503.000000
mean     11.485018
std       8.830294
min       5.000000
25%       6.000000
50%       8.000000
75%      13.000000
max      65.000000

In [25]:
names.describe(include="all")

         Name Gender State        Count
count    2503   2503  2503  2503.000000
unique    575      2     1          NaN
top     Riley      F    AK          NaN
freq       12   2404  2503          NaN
mean      NaN    NaN   NaN    11.485018
std       NaN    NaN   NaN     8.830294
min       NaN    NaN   NaN     5.000000
25%       NaN    NaN   NaN     6.000000
50%       NaN    NaN   NaN     8.000000
75%       NaN    NaN   NaN    13.000000
max       NaN    NaN   NaN    65.000000